In [3]:
pip install pandas

Requirement already satisfied: pandas in c:\users\thale\appdata\local\packages\pythonsoftwarefoundation.python.3.11_qbz5n2kfra8p0\localcache\local-packages\python311\site-packages (2.2.2)
Requirement already satisfied: numpy>=1.23.2 in c:\users\thale\appdata\local\packages\pythonsoftwarefoundation.python.3.11_qbz5n2kfra8p0\localcache\local-packages\python311\site-packages (from pandas) (2.0.1)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\thale\appdata\local\packages\pythonsoftwarefoundation.python.3.11_qbz5n2kfra8p0\localcache\local-packages\python311\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\thale\appdata\local\packages\pythonsoftwarefoundation.python.3.11_qbz5n2kfra8p0\localcache\local-packages\python311\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\thale\appdata\local\packages\pythonsoftwarefoundation.python.3.11_qbz5n2kfra8p0\localcache\local-packages\python311\site-packages (from pandas) (2024.1)
Requirement already satisfied: six>=1.5 in c:\users\thale\appdata\local\packages\pythonsoftwarefoundation.python.3.11_qbz5n2kfra8p0\localcache\local-packages\python311\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 24.0 -> 24.2
[notice] To update, run: C:\Users\thale\AppData\Local\Microsoft\WindowsApps\PythonSoftwareFoundation.Python.3.11_qbz5n2kfra8p0\python.exe -m pip install --upgrade pip

In [4]:
import pandas as pd

In [21]:
Dicionario1 ={
    "ID":['1','2','3','4'],
    "Nome":['Ana','Pedro','Maria','João'],
    "Setor":['RH','Vendas','Administrativo','Produção'],
    
}
Labels1 = ['','','','']

In [22]:
dados1 = pd.DataFrame(Dicionario1, index= Labels1)

In [23]:
dados1.head()

 ID   Nome           Setor
  1    Ana              RH
  2  Pedro          Vendas
  3  Maria  Administrativo
  4   João        Produção

In [24]:
Dicionario2 ={
    "ID":['1','2','3','4'],
    "Salario":['3000,00','2800,00','3200,00','2500,00'],
}
Labels2 = ["","","",""]

In [25]:
dados2 = pd.DataFrame(Dicionario2, index=Labels2)

In [26]:
dados2.head()

 ID  Salario
  1  3000,00
  2  2800,00
  3  3200,00
  4  2500,00

In [28]:
dados_unificado = pd.merge(dados1,dados2, how='left', on='ID')

In [29]:
dados_unificado.head()

  ID   Nome           Setor  Salario
0  1    Ana              RH  3000,00
1  2  Pedro          Vendas  2800,00
2  3  Maria  Administrativo  3200,00
3  4   João        Produção  2500,00